In [1]:
import pandas as pd
import numpy as np

In [2]:
import afe

In [3]:
df = pd.DataFrame({'one': [1,2,3,10], 'two': [2,3,4,5], 'class': [1,1,1,0], 'label': [0,0,0,1]})

In [4]:
x = df[['one','two','class']]
y = df['label']

In [10]:
x

   one  two  class
0    1    2      1
1    2    3      1
2    3    4      1
3   10    5      0

In [12]:
afe.add(x)

/Users/juliusriel/miniforge3/lib/python3.9/site-packages/pandas/core/arraylike.py:397: RuntimeWarning: divide by zero encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)

   log(one)  log(two)  log(class)
0  0.000000  0.693147         0.0
1  0.693147  1.098612         0.0
2  1.098612  1.386294         0.0
3  2.302585  1.609438        -inf

In [31]:
x.columns.tolist()

['one', 'two', 'class']

In [32]:
x['one'] + x['two']

0     3
1     5
2     7
3    15
dtype: int64

In [35]:
def add(x):
    x_ = pd.DataFrame()
    for name in x.columns.tolist():
        column_names = x.columns.tolist()
        column_names.remove(name)
        for oth_name in column_names:
            new_col_name = "{} {} {}".format(name, '+', oth_name)
            x_[new_col_name] = x[name] + x[oth_name]
    return x_

In [39]:
def multiply(x):
    x_ = pd.DataFrame()
    for name in x.columns.tolist():
        column_names = x.columns.tolist()
        column_names.remove(name)
        for oth_name in column_names:
            new_col_name = "{} {} {}".format(name, '*', oth_name)
            x_[new_col_name] = x[name] * x[oth_name]
    return x_

In [40]:
multiply(x)

   one * two  one * class  two * one  two * class  class * one  class * two
0          2            1          2            2            1            2
1          6            2          6            3            2            3
2         12            3         12            4            3            4
3         50            0         50            0            0            0

In [41]:
g = 'hi'

In [45]:
"log({})".format(g)

'log(hi)'

In [48]:
np.log(x['one'])

0    0.000000
1    0.693147
2    1.098612
3    2.302585
Name: one, dtype: float64